[
  {
    "rank": 10,
    "title": "Battle of Hong Kong",
    "year": "1941",
    "description": "Canada entered World War II in 1939, but the Canadian Army didn't participate in much combat for the first two years. The Prime Minister William Lyon Mackenzie king was careful about sending Canadian troops overseas, as he instead focused on military weapon production, food production, and the British Commonwealth Air Training Plan. In 1941, Britain requested Canadian troops to reinforce Hong Kong, even know they believed it was impossible to defend. Mackenzie king agreed, as he thought it wouldn't be very risky.\n\nThe Canadian troops that were sent to Hong Kong were composed of roughly 1,975 soilders from the Winnipeg Grenadiers and the Royal Rifles of Canada, arriving on November 16th, 1941. Neither regiment was really trained or prepared for a lot of combat, and a ton of soilders underestimated the Japanese military due to racism. On December 7th, 1941, Japan attacked Pearl Harbor, and after another six hours they invaded Hong Kong.\n\nThe Japanese forces attacked the airfields and overwhelmed mainland defenses, which fell quickly. By December 13th, 1941, they lost the mainland, and the Allied troops retreated back to Hong Kong Island. They had no reinforcements, and they prepared for a final fight. They fought on the island for roughly two weeks under harsh conditions, eventually being left exhausted and outmatched.\n\nThe Battle of Hong Hong lasted from December 8th to 25th, 1941, and ended with a surrender on Christmas. Throughout the battle, 290 Canadians were killed and 493 were wounded, and then another 264 died later in Japanese POW camps. After their surrender, the Canadian POWs were beaten, starved, and had to do forced labour, as the Japanese saw surrender as cowardly, making them treat Canadians with extreme cruelty and violence.\n\nIn August 1945, Japan eventually surrendered after the atomic bombings of Hiroshima and Nagasaki, and food and medical aid were given to prisoner camps. The Battle of Hong Kong remains as one of the most signficant events in Canadian history, being the first land battle involving Canadian troops in World War II, and displaying the sacrifice of Canadians fighting under brutal conditions.",
    "images": ["/src/assets/images/battleofhongkong1.jpg", "/src/assets/images/battleofhongkong2.jpg"],
    "bgColor": "bg-red-900"
  },
  {
    "rank": 9,
    "title": "Dieppe Raid",
    "year": "1942",
    "description": "After the miracle of Dunkirk, the Allied forces were forced to retreat whilst Germany was pushing into Russian territory. The Allies weren't strong enough to pull off Operation Overlord, so instead they planned a smaller attack known as the Dieppe Raid. Their goal was to gain combat experience and test the strength of Allied equipment by targeting a port in France, with Canadian troops leading the main attack.\n\nOn May 20th, 1942, troops were positioned on the Isle of Wight, located in the English Channel, training for the operation. Due to poor weather conditions, the attack was delayed until August. The invading force was mainly made up of Canadians, with around 5000/6100 of the soilders being Canadian. The raid took place on the morning of August 19th, 1942, with the Allied forces attacking at five different points along the battlefront.\n\nThe attack was unsuccessful as the allies lost the element of suprise. The sharp and violent noises alerted the German defenses on the coast, allowing them to prepare and man their positions before the Allies arrived. As a result, the attack troops faced heavy fire almost immediately after they landed.\n\nAfter nine hours of fighting, 907 Canadian soilders were killed, 2406 were wounded, and 1946 were taken prisoner. There were more Canadians captured during the Dieppe Raid than in eleven months of fighting in Northwest Europe between 1944 and 1945. The scale of the losses suprised allied leaders, as no one could have immagined how terrible the operation would turn out. The Dieppe Raid became one of the most significant defeats in Canadian military history.",
    "bgColor": "bg-purple-900",
    "images": ["/src/assets/images/diepperaid1.png", "/src/assets/images/diepperaid2.png"]
  },
  {
    "rank": 8,
    "title": "Battle of the Atlantic",
    "year": "1939 - 1945",
    "description": "The Battle of the Atlantic lasted from September 3rd, 1939, to May 8th, 1945, making it the longest continous battle of World War II. Their goal was for the Allies to have control of the shipping lanes between North America and Europe in order to transport food, troops, and war supplies to Britain. This battle was really important to Canada, as Canada was responsible for shipping a lot of these supplies across the Atlantic. The first attack was on September 3rd, 1939, when the German U-boat U-30 sank the passenger ship SS Athenia, killing 112 people including four Canadians.\n\nCanada's responsibility was to escort merchant ships sailing from Halifax, Sydney, and St. Johns. The first convoy, HX-1 left on September 16th, 1939, and was escorted by two Canadian destroyers, HMCS St. Laurent and HMCS Saguenay. At the beginning of the war, Canada's navy was very small, as there were only six destroyers and 3,500 sailors. Canada grew its navy by building many ships including smaller corvettes designed to protect covoys.\n\nOne of the most dangerous areas during the battle was the Black Pit located in the middle of the Atlantic Ocean. This place was so dangerous as it was located far out of range for any Allied aircraft to reach, and thus was the site of many deadly attacks.In 1942, German U-boats reached Canadian and American coastlines, entering the Gulf of St. Lawrence and sinking 21 ships. This was the first time the combat had ever reached Canadian waters. At this time, Germany was at the peak of their success in the battle, roughly sinking a hundred ships per month. At the end of 1942, around 2,000 ships had been lost.\n\nIn 1943, the Allies started to make a comeback in the Battle of the Atlantic. They had crackled the Enigma code, developed aircraft that could fly much further, and made improved escort ships that protected convoys through the Black Pit. Allied losses dropped dramatically, with only 300 ships being lost in 1943 and the spring of 1944. Canadian ships sank 8 German U-boats between the end of 1943 and spring of 1944. The battle was still dangerous, as newer German U-boats developed advanced torpedoes able to lock onto propeller sounds. In September, 1943, the HMCS St. Croix was sunk by an acoustic torpedo, and almost all survivors were killed when the rescue ship was sunk as well.\n\nBy the final year of the war, eight Canadian warships had been sunk and four damaged, but Canada's navy had greatly increased in size. As the war was coming to an end, the Allies placed all naval forces stretching from Nova Scotia to the Arctic under Canadian command. By 1945, Canada possessed 487 warships, 90,000 sailors, 3,000 landing craft, and 400 cargo ships. The Battle of the Atlantic was vital for the Allied victory, as they needed to maintain the supply routes to Britain to win the war.",
    "bgColor": "bg-cyan-900",
    "images": ["/src/assets/images/atlanticbattle1.jpg", "/src/assets/images/atlanticbattle2.jpg"]
  },
  {
    "rank": 7,
    "title": "Battle of Vimy Ridge",
    "year": "1917",
    "description": "The Battle of Vimy Ridge took place from April 9th to April 12th, 1917, during World War I. The battle was fought between the Canadian Corps and the German Empire in the heavily fortified Vimy Ridge area. By 1917, the war had reached a stalemate due to trench warfare. The Canadian Corps aimed to capture Vimy Ridge in order to draw German forces away from the French, who had already suffered over 100,000 casualties in previous failed attempts to take the ridge. Germany had controlled Vimy Ridge since 1914 and had reinforced it with multiple trench lines, barbed wire, machine-gun bunkers, and underground shelters.\n\nAbout 100,000 Canadian soldiers arrived to get ready for the attack after the Battle of the Somme in late 1916. In March 1917, extensive preparations were made, including the rebuilding of roads and trenches, the installation of water systems, the laying of more than 100 kilometers of communication lines, and the use of roughly 50,000 horses to move supplies. Eleven tunnels with meeting rooms, first aid stations, lighting, and water were constructed to reach the front lines. Troops could move around safely without having to cross any exposed ground thanks to these tunnels.\n\nImproved artillery coordination, specialized platoon roles like machine-gunners and grenadiers, and comprehensive maps and scale models of the battlefield were among the new tactics implemented for the conflict. With new fuses that caused shells to explode on impact rather than on a timer, the Canadians had an almost limitless supply of artillery shells. Over a million shells were fired at German positions during a week-long artillery barrage that the Germans called the 'Week of Suffering'.\n\nOn Easter Monday, April 9, 1917, at 5:30 a.m., 15,000 Canadian soldiers advanced in the first wave of the battle. By the evening, the first three Canadian divisions had advanced up to five kilometers, the greatest Allied advance of the war at the time, and had taken all of their targets. Vimy Ridge was successfully taken after four days of fighting. German forces suffered about 20,000 casualties, including 4,000 captured, while Canadian losses included 3,598 soldiers killed and roughly 7,000 wounded.\n\nA significant turning point in Canadian history was the Battle of Vimy Ridge. All four Canadian divisions fought together under Canadian command for the first time. In the years that followed, Canada's growing independence from Britain was aided by this victory, which led to the country's international recognition as a nation rather than just a British colony.",
    "bgColor": "bg-green-900",
    "images": ["/src/assets/images/vimyridge1.jpg", "/src/assets/images/vimyridge2.jpg"]
  },
  {
    "rank": 6,
    "title": "Fall of the Berlin Wall",
    "year": "1989",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-orange-900"
  },
  {
    "rank": 5,
    "title": "The Great Depression",
    "year": "1929 - 1939",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-gray-900"
  },
  {
    "rank": 4,
    "title": "D-Day Invasion of Juno Beach",
    "year": "1944",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-red-900"
  },
  {
    "rank": 3,
    "title": "The Manhattan Project",
    "year": "1942 - 1945",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-yellow-900"
  },
  {
    "rank": 2,
    "title": "Operation Barbarossa",
    "year": "1941",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-violet-900"
  },
  {
    "rank": 1,
    "title": "The Moon Landing",
    "year": "1969",
    "description": "example text\n\nexample text\n\nexample text\n\nexample text\n\nexample text",
    "bgColor": "bg-sky-900"
  }
]
